# FabricationSaveJobOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationSaveJobOptions Class
Members See Also
---
Options for FabricationPart.SaveAsFabricationJob() method.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class FabricationSaveJobOptions : IDisposable
```

Visual Basic
---
```text
Public Class FabricationSaveJobOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationSaveJobOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Fabrication..::..FabricationSaveJobOptions
# See Also
FabricationSaveJobOptions Members
Autodesk.Revit.DB.Fabrication Namespace